import { createResource } from 'solid-js';
import { getData } from './api';

export const roles: { [key: string]: any } = {
    ar: [{ id: 0, role: 'مستخدم' }, { id: 1, role: 'مدير' }],
    en: [{ id: 0, role: 'Users' }, { id: 1, role: 'Manager' }],
};

export const [category] = createResource(
    // () => getData('table', 'category'),
    () => [
        {
            category_id: '1',
            category_name: 'الفئة 1',
            materials:
                'الكيماويات المســتخدمة في الصناعة والبحث العلمي والتصوير الفوتوغرافي وكذلك في الزراعة والبســـتنة وزراعة الغابات راتنج اصطناعي غير معالج ، بلاستيك غير معالج ، أسمدة ، مركبات إخماد النيران مستـــحضرات سقي ولحام المعادن ، مواد كيميائية لحفظ المواد الغذائية، مواد دباغة ، مواد اللصق المستخدمة في الصناعة',
        },
        {
            category_id: '2',
            category_name: 'الفئة 2',
            materials:
                'الدهانات والورنيــــش واللاكيه والمواد التي تســــتخدم لوقاية المعادن من الصدأ والخشب ومواد التلوين والبويا ومواد الدباغة والمواد الكيميائية الخاصة بتثبيت الألـوان والراتنجات الطبيعية والمعادن المتخذة بشكل رقائق أو المسحوقة التي تستخدم في النقش والزخرفة والدهانين وفنيي الديكور وعمال الطباعة والفنانين',
        },
        {
            category_id: '3',
            category_name: 'الفئة 3',
            materials:
                'مستحضرات تبييض الأقمشة ومواد أخرى تستعمل في غسل وكي الملابس، مستحضرات ومواد تنظيف وصقل وجلي وكشط ، مسحوق الغسيل و سائل الجلي ، ومستحضرات ومواد معقمة ومطهرة ليست لغايات طبية ،صابون غير طبي ، عطور وزيوت عطرية، مواد زينة وتجميل وهي حمرة ،كحلة ،ظل ،مسكرة ،بودرة وكريم مكياج ،حمرة خدود ،أقلام تخطيط ، محارم معطرة لإزالة المكياج ، ومناديل مشربة بغسولات ومواد عطرية ، معجون حلاقة، مستحضرات ومزيلات الروائح الكريهة والعرق ، مستحضرات إزالة الشعر (مكونة من مواد سكرية وغيرها ) ، طلاء أظافر ومستحضرات إزالة طلاء الأظافر ، غسول (لوشن) للشعر ، الشامبو لا يحمل أية ادعاءات طبية ومستحضرات العناية بالشعر ، أصباغ الشعر والحناء، وزيوت للعناية بالشعر والجسم ليست لغايات طبية ، بودرة أطفال ، كريمات وملمعات الأحذية.',
        },
        {
            category_id: '4',
            category_name: 'الفئة 4',
            materials:
                'الزيوت والشـــحوم الصناعية والمعدنية ، مركبات إمتصاص وترطيب وتثبيت الغبار ، وقود ( بما في ذلك وقود المحركات ) ومواد الإضاءة ، الشموع وفتائل للإضاءة والفحم وغاز ,الوقود وغاز للإضاءة وغاز المولدات وزيوت المحركات',
        },
        {
            category_id: '5',
            category_name: 'الفئة 5',
            materials:
                'مستحضرات صيدلانية وبيطرية, والأدوية البشرية ومستحضرات صحية لغايات طبية, مواد وأغذية حمية معدة للإستعمال الطبي أو البيطري وأغذية للرضع والأطفال، مكملات للحمية الغذائية للإنسان والحيوان , لصقات ومواد ضماد, مواد حشو الأسنان وشمع طب الأسنان, مواد معقمة ومطهرات, كريمات لغايات طبية, مستحضرات لإبادة الحشرات والحيوانات الضارة, مبيدات فطريات ومبيدات أعشاب, الصابون الطبي.',
        },
        {
            category_id: '6',
            category_name: 'الفئة 6',
            materials:
                'معادن غير نفيسة وكل خليط منها ، مواد بناء معدنية ، مباني معدنية قابلة للنقل ، مواد معدنية لخطوط السكك الحديدية ، حبال وأسلاك غير كهربائية من معادن غير نفيسة ، مصنوعات حداده ،  وخردوات معدنية صغيرة ، مواسير وأنابيب معدنية ، خزائن حفظ الوثائق والأشياء الثمينة مصنوعة من معادن غير نفيسة ( غير واردة في فئات أخري ) خامات معادن .',
        },
        {
            category_id: '7',
            category_name: 'الفئة 7',
            materials:
                'الغسالات وقطعها والنشــافات والجلايات وأجهزة تفقيس البيض وآلات الخفق والخلاطات والعصارات والفرامات ومطاحن البن والمكانـس الكهربائيـــة والمصاعد وقطعها والحفارات والمولدات والمضخات والسكاكين الكهربائية وآلات المطبخ الكهربائية وآلات العجن وآلات الحياكة وآلات التغليف والتعبئة والحراقات والعجانات والقشارات والمحركات الكهربائية والصناعية والزراعية .',
        },
        {
            category_id: '8',
            category_name: 'الفئة 8',
            materials:
                'العدد والأدوات اليدوية ( تُدار باليد ) ، أدوات قطع ( الشُّوك والسكاكين والملاعق ) ، الأسلحة البيضاء ، أدوات الحلاقة ، معدات زراعية ( تدار باليد ) ، مثاقب وفؤوس ومقصات شــعر وأحزمة للعدد ، الشــــفرات والمضفرات ومطارق للنقش ، ملاقط لتجعيد الشعر ، أدوات النجارين اليدوية أطقم العناية بأظافر اليدين',
        },
        {
            category_id: '9',
            category_name: 'الفئة 9',
            materials:
                'الأدوات الكهربائية والالكترونية المســتخدمة في التوصيل الكهربائي والقواطع الكهربائية ونقل الكهرباء وتجميعها والتحكم بها وأجهزة التســجيل ونقل وإعادة وإنتاج الصوت والصورة والحواســب وقطعها وأكسســواراتها والآلات الحاسبة ومكاوي اللحام الكهربائية والمكاوي المسطحة الكهربائية وأجهزة صعق الحشرات والتلفزيونات والمسجلات وأجهزة الريسـيفر والفيديو والفيديو CD والـ DVD  والكاميرات والهوائيات وأجهزة الاتصالات والهواتف والبطاريات الجافة والأبيال والشـواحن ومكبرات الصوت والميكروفونات والسـماعات والكابلات وأجهزة الإنذار وأنظمة الصوت والمراقبة وأجهزة التحكم وطفايات الحريق',
        },
        {
            category_id: '10',
            category_name: 'الفئة 10',
            materials:
                'الأجهزة والأدوات الجراحية والطبية وطب الأسنان والبيطرية ، الأطراف والعيون والأسنان الصناعية وأدوات التجبير ومواد خياطة أو درز الجروح, أجهزة تخطيط القلب الكهربائي, مسبار للأغراض الطبية, جهاز أشعة للأغراض الطبية, جهاز تشخيص فوق صوتي, جهاز تنظير مرئي. جهاز تنظير إلكتروني, محطة عمل طبية, ونظام تصنيف الصور , مشدات بطن',
        },
        {
            category_id: '11',
            category_name: 'الفئة 11',
            materials:
                'أجهزة وأدوات الإنارة والمدافئ والسخانات والمكيفات والاســبراتورات والمراوح ومجففات الشعر والأفران والشــوايات وأواني الطهي الكهربائية والأدوات الصحية ولوازمها والبرادات والمجمدات ومبردات الماء أجهزة إزالة الروائح الكريهة من الجو ، معقمات هواء ، منشـآت لحمام الساونا ، أحواض اســـتحمام ( بانيو ) ، دفايات فراش ، محمصات خبز ، أضواء للســــيارات والدراجات النارية والهوائية ، محمصات بن، أوعية طهي ، سجاد يدفأ كهربائيا ، مولدات ومصابيح وقداحات غاز ، آلات وأجهزة لصنع الثلج، منشآت لتوريد وتنقية المياه',
        },
        {
            category_id: '12',
            category_name: 'الفئة 12',
            materials:
                'الســيارات وقطع تبديلها وقطع زينة كهربائية للسيارات والإطارات والدراجات النارية والهوائية وقطع تبديلها واكسسواراتها والمركبات وأجهزة النقل البري أو البحري أو الجوي وقطع تبديلها ، ناقلات هوائية ( تلفريك ) ، أجهزة إنذار ضد السرقة للســيارات ، عربات الأطفال وقطعها ، مناطيد ، قوارب وقطعها ومجاديف للقوارب ، بيوت متنقلة بمحركات ، كراســي المقعدين ، يخوت وزوارق',
        },
        {
            category_id: '13',
            category_name: 'الفئة 13',
            materials: '',
        },
        {
            category_id: '14',
            category_name: 'الفئة 14',
            materials:
                'المعادن النفيســة وكل خليط منها والمنتجات المصنوعة من معادن نفيسة أو المطلية بها ، غير الواردة في فئات أخرى ، المجوهرات والأحجار الكريمـة ، أدوات قياس الوقت وأدوات قياس الوقت الدقيقة ، الســـاعات والساعات المنبهة وقطعها ، المجوهرات التقليدية ، أوعية منزلية ومطبخ من معادن نفيسة ، التحف والفازات والمزهريات من معادن نفيسة ، شمعدانات وصناديق وعلب ومباسم سيجار من معادن نفيسة',
        },
        {
            category_id: '15',
            category_name: 'الفئة 15',
            materials: 'الأدوات الموسيقية .',
        },
        {
            category_id: '16',
            category_name: 'الفئة 16',
            materials:
                'الورق والأصناف المصنوعـة منه والورق المقوى ( الكرتون ) والأصناف المصنوعـــة منه ، المطبوعات والجرائد والدوريات والكتب ومواد التجليد ، الصــور الفوتوغرافية والقرطاسية والأدوات الكتابية ومواد اللصق ( المستعملة في القرطاسية أو لغايات منزلية ) ، الأدوات الخاصة بالفنانين وفراشـي الدهان أو التلوين والآلات الكاتبـة ولوازم المكاتب ( عدا الأثاث ) والأدوات التي تسـتخدم في التهذيب والتعليم ( عدا الأجهزة ) ، بطاقات تهنئة ومواد التغليف البلاستيكية ، الأحبار وحروف الطباعة والفهارس والخرائط الجغرافية والكليشـــيهات ( لوح الطباعة ) وورق اللعب ، المحارم الورقية وفوط الأطفال من الورق وفوط المســنين وورق التواليت والمطابخ والحمامات',
        },
        {
            category_id: '17',
            category_name: 'الفئة 17',
            materials:
                'المطاط والغوتابرشا والصمغ والأســبستوس والميكا والمنتجات المصنوعة من هذه المواد وغير واردة في فئات أخرى ، مواد بلاســتيكية متشكلة بالبثق للاستعمال في التصنيع ، مواد التغليف والحشو والعزل ، أنابيب مرنة غير معدنية ، أكياس من المطاط للتغليف وحبال مطاطية ، القطن الخام للحشو ، خراطيم ري ولإطفاء الحريق ، دهانات وزيوت وأنسجة عازلة مواد عازلة للرطوبة في المباني وورق عازل',
        },
        {
            category_id: '18',
            category_name: 'الفئة 18',
            materials:
                'الجلود المدبوغة وتقليدها والأصناف المصنـوعة منها ( غير واردة ضمن فئات أخرى ) ، الجلود الخام والقشـــرة ، جلود الحيوانات الخام أو المدبوغة ، الصناديق والحقائب والجزادين والأحزمة والخيوط الجلدية ، الشــماسي والمظلات والعصي والسياط وأطقم الخيل والسروج ، أكياس جلدية للتعبئة ، صناديق موسيقية جلدية ، محافظ وحقائب جيب',
        },
        {
            category_id: '19',
            category_name: 'الفئة 19',
            materials:
                'مواد البناء ( غير المعدنية ) أنابيب قاســية غير معدنية للمباني ، الإسفلت والزفت والقار والاسمنت والحصى والطين والرمل ، المباني غير المعدنية القابلة للنقل ، النصب ( مجسمات ) غير معدنية ، الخشب شــــبه المشغول وزجاج المباني ، الإسطبلات وبرك السباحة وجميع أنواع الأحجار والبلاط والخشـب والزجاج والبلور الخاصة بالبناء غير المعدنية والمداخن والمرمر والأعمدة غير المعدنية ، خشـب للبناء ، ورق مقوى للبناء، الأخشاب والألواح الخشبية والفلين المضغوط والأسقف غير المعدنية، فسيفساء للبناء والرخام والجبص',
        },
        {
            category_id: '20',
            category_name: 'الفئة 20',
            materials:
                'الأثاث والمرايا وإطارات الصور ، المنتجات ( غير الواردة في فئات أخرى ) المصنوعـة من الخشــب أو الفلين أو الغاب أو الخيزران أو الصفصاف أو القرون أو العظام أو العاج أو عظم الحوت أو الصدف أو الكهرمان أو المحار أو المرشوم والمواد البديلة لكل هذه المواد ، أو من المواد البلاستيكية ، وسائد وفرشات ومخدات هوائية ليســــت لغايات طبية ، قضبان ولوحات من الكهرمان ، ســلالم غير معدنية ، الأسرّة بكافة أنواعها ، مناضد للعمل ، الخزانات الخشبية وخزانات الكتب والكراسي والطاولات وأجراس الزينة',
        },
        {
            category_id: '21',
            category_name: 'الفئة 21',
            materials:
                'أدوات وأواني وأوعية للاستعمال المنزلي وللمطبخ ( ليست من معادن نفيسة أو مطلية بها ) ، أمشـاط وأسفنج ، فراشي ( عدا فراشي التلوين أو الدهان ) ، مواد صنع الفراشي ومنتجات الفراشـي ، أدوات تنظيف ، ومكانس وجلود للتنظيف ومماسح للتنظيف وقطع قماش مشربة بمنظفات للتنظيف ومسـاحات أرضية ومناشر ملابس وملاقط غسيل وسلك جلي، زجاج غير مشغول أو زجاج شبه مشــــغول ( عدا الزجاج المســتعمل في المباني)، أواني زجاجية وأواني خزف صيني وأواني خزفية غير واردة في فئات أخرى، منافض غبار وصناديق نفايات .',
        },
        {
            category_id: '22',
            category_name: 'الفئة 22',
            materials:
                'الحبال والخيوط والشـبكات والخيم والمظلات والمشمع والأشرعة والغرارات والأكياس ( غير الواردة في فئات أخرى ) ، مواد التبطين والحشـو ( عدا ما كان من المطاط أو البلاستيك )، مواد نسـيج من الألياف الخام، ريش لفرش النوم ، الصوف، الألياف النسيجية، أحزمة غير معدنية لربط الأمتعة، شـباك الصيد ، القطن والحرير والكتان الخام ، الأشرعة والمشمع والخيام والقش للتنجيد',
        },
        {
            category_id: '23',
            category_name: 'الفئة 23',
            materials: 'الغزل والخيوط المستخدمة في النسيج',
        },
        {
            category_id: '24',
            category_name: 'الفئة 24',
            materials:
                'المنسوجات بالقطعة أو ذات الأطوال المحدودة وأغطية الفراش والموائد والأقمشة بكافة أنواعها والأغطية والشراشف بكافة أنواعها وأقمشة البرادي والمفروشـــات والنسيج الآلي بكافة أنواعه والحرامات والمخامل والأجواخ والبياضات والبرانص والمناشــف والبشـاكير والوسائد والملاحف والمفارش واللحف ووجوه مخدات والدانتيل وأكياس الخيش والبسط والناموسيات والتول والزفير والمخمل والمطرزات من النسيج .',
        },
        {
            category_id: '25',
            category_name: 'الفئة 25',
            materials:
                'الألبسة الجاهزة الخارجية الرجالية والنســائية والولادية والبناتية وألبسة العرائس والسهرة والألبســــة الداخلية والألبسة القطنية والقمصان والبيجامات والألبسـة الشـعبية وألبسة التريكو والجوارب بكافة أنواعها والأحذية الجلدية والرياضية وكعوب للأحذية والألبسـة الرياضية والألبسـة الجلدية والألبسة المهنية وأغطية الرأس والاشاربات والحجابات والقبعات والمعاطف ومشدات للنساء والقفافيز',
        },
        {
            category_id: '26',
            category_name: 'الفئة 26',
            materials:
                'المخرمات والمطرزات والأشـــرطة والجدائل، الأزرار والكلابات والعراوي والدبابيس والإبر والزهور الإصطناعية ، سحابات للحقائب ، أربطة ومشابك شعر ، خصل ولحي وشعر مستعار ، علب خياطة ، ســـنارات حبك للتطريز ، خيوط معدنية للتطريز ، السحابات بكافة أنواعها ، خردوات خياطة ، حلي وضفائر شعر ، كشاكش للألبسة والتطريز',
        },
        {
            category_id: '27',
            category_name: 'الفئة 27',
            materials:
                'السـجاد والبسط والحصر ومفارش الحصير ومشمع فرش الأرضيات ومواد أخرى لتغطية الأرضيات القائمة ومطرزات تعلق على الجدران ( من مواد غير نســيجية ) ، طبقات أعشاب إصطناعية ، سجاد سيارات ، مداسات حمام ، حصر لصالات الرياضة البدنية ، ورق جدران',
        },
        {
            category_id: '28',
            category_name: 'الفئة 28',
            materials:
                'اللعب وأدوات اللعب، أدوات الرياضة الجمنازية والأدوات الرياضية غير الواردة في فئات أخرى زينة لشــجرة عيد الميلاد ، آلات تسلية تعمل أتوماتيكيا وبالنقد ، أدوات رماية ، ألعاب النرد ، بالونات لعب ، كرات اللعب بكافة أنواعها ، أدوات البلياردو ، ألعاب الشــطرنج والداما ، مضارب غولف ، أثقال يدوية ، عدة وصنانير لصيد الســمك ، قفافيز مبارزة وبيسبول وملاكمة ولعبة الغولف ، زلاجات جليد ، طائرات ورقية ، أقنعة لعب ، ألواح شــراعية ، طاولات ومضارب تنس ، أرجوحات وبرك سباحة',
        },
        {
            category_id: '29',
            category_name: 'الفئة 29',
            materials:
                'اللحوم والأســماك والطيور الداجنة وطيور الصيد ، مستخرجات اللحوم وأعشاب بحرية للطعام ، اللحوم المحفوظة والمعلبة والطون والسـردين والمرتديلا ، الفواكه والخضـروات المحفوظة والمجففة والمثلجة والمعلبة والمطهية والجيلاتين وســلطات الفواكه والمربيات والمخللات ورب البندورة ، مرقة الدجاج والشوربات ومستحضرات لصنع الشوربات واللوز المطحون والأغذية والبقول المحفوظة والمعلبة والقمر الدين والتمور والعجوة والخشافات ، والمقبلات الغذائية من البطاطا والطحينة والموالح والمكســرات وجوز الهند المجفف والزبيب وزيت ســمسم ، البيض واللبن وغيره من منتجات الألبـان ( زبدة وسمنة حيواني ) جبنة وحليب طازج أو منكه وشحوم صالحة للتغذية وزبدة الفول السوداني والزبدة بكافة أنواعها والقشــدة ومشروبات الحليب ، الزيوت الغذائية بكافة أنواعها والسمون النباتية ، زيوت مهدرجة صالحة للتغذية ، مارغرين',
        },
        {
            category_id: '30',
            category_name: 'الفئة 30',
            materials:
                'البن والشـاي والكاكاو والسكر والأرز والتابيوكا والساغو والبن الإصطناعي والهيل والمته ، الدقيق والمسـتحضرات المصنوعة من الحبوب والخبز والسميد ونشا الطعام والفطائر والمعجنات والبيتزا والكعك والحلـويات والحلويات المثلجة والبتي فور والسـندويشات، عسل النحل والعسل الأسود ، الخميرة ومسحوق الخبيز واليانسون والزنجبيل والزعفران وجلكوز للطعام وأصابع السوس وهلاميات وسـوشي ومستحضرات منكهة للطعام ومشروبات أساسها الشوكولا أو الكاكاو أو القهوة والمنكهات الغذائية ، والمعكرونة والشـعيرية والمسـاحيق الغذائية والفانيليا والبيكينغ باودر والمقبلات الغذائية من الحبوب والفشـــار والحلاوة الطحينية ، الملح والخردل والخل والزعتر والبهارات والتوابـل والقرفة وجوزة الطيب ورقائق شوفان وشوفان مطحون ومقشر والفلفل والصلصات والشـــــطة وصلصة الصويا والكتشــب والمايونيز والكســترد ودبس الطعام البوظة والمثلجات والثلج ، البسكويت والشوكولاته والحشوات المغطسة بالشوكولا وبسكويت البرشام ، العلكة والسكاكر والملبس والفوندان ومصاص الأطفال والراحة والنوكا والراحة المحشية والقضامة السكرية\r\n\r\n',
        },
        {
            category_id: '31',
            category_name: 'الفئة 31',
            materials:
                'الحاصلات الزراعية ومنتجات البســاتين والغابات والغلال والحبوب ( غير واردة بفئات أخرى ) والفول والعدس والبازيلاء والفاصوليا والحمص الحب وحبوب الكاكاو والقمــح ، اللوز والجوز والصنوبر والكاجو وجوز الهند والبندق والذرة الصفراء الحيوانات الحية وبيض السمك ، الفـواكه والخضروات الطازجة والبذور والشمندر والسمســم والكستنة والفطر الطازج والشوفان والزيتون الطازج النباتات الحيــــة والزهور الطبيعية وأكاليل من الزهور الطبيعية والشجيرات وقصب السـكر والأشجار والكمأة الطازجة والسبانخ الطازجة ، المواد الغذائية للحيوانات شعب البيرة والعلف والشعير',
        },
        {
            category_id: '32',
            category_name: 'الفئة 32',
            materials:
                'البيرة ( الجعة الســوداء والبيرة السوداء ) وشراب الشعير ، المياه المعدنية الغازية ومشروبات الطاقة غير الكحولية ، الشراب وغيره من المسـتحضرات لعمل المشروبات ، عصير الفواكه وكافة أنواع العصائر الطبيعية ، مشروبات مسـتخلصة من الفواكه ، كوكتيلات غير كحولية ، مساحيق وأقراص محلاة للمشروبات الفوارة ، ماء الزهر وماء الورد',
        },
        {
            category_id: '33',
            category_name: 'الفئة 33',
            materials: '',
        },
        {
            category_id: '34',
            category_name: 'الفئة 34',
            materials:
                'التبع ، أدوات المدخنين ، الثقاب ، رزم من أوراق السـجائر ، منافض وعلب ومباسم سجائر وسيجار ليست من معادن نفيسة ، سيجار ، مقاطع للسيجار ، حجارة النار ، قداحات مدخنين ، بزابيز لمباسم السجائر',
        },
        {
            category_id: '35',
            category_name: 'الفئة 35',
            materials:
                'خدمات الدعاية والإعلان – آرمة محل ( اسم الشركة ) – وإدارة وتوجيه الأعمال وتفعيل النشاط المكتبي وخدمة الاستيراد والتصدير والمعارض ودخول المناقصات والمزايدات وتمثيل الشركات والوكالات العربية والأجنبية والأعمال الإدارية وخدمات المعارض وخدمة إقامة وتنظيم واستثمار المجمعات التجارية والمولات',
        },
        {
            category_id: '36',
            category_name: 'الفئة 36',
            materials:
                'خدمات التأمين والشـؤون التمويلية والمالية والعقارية وخدمات المصارف وتحويل الأموال الكترونيا والضمانات والأعمال المصرفية والصرافة والتخليص وهيئات التســليف وصناديق الاســتثمار وخدمات العقارات وتأجير الشقق وخدمات التثمين وخدمات المحاســبة والتأمين والضمانات والبورصة والتقييم المالي وتأجير المزارع والعقارات وخدمـات القروض وبطاقاتى الائتمان والسمسرة واستثمار رؤوس الأموال وجمع التبرعات الخيرية والاستشارات والمعلومات والإدارة والكفالات المالية',
        },
        {
            category_id: '37',
            category_name: 'الفئة 37',
            materials:
                'خدمات إنشـاء المباني والإصلاح وخدمات التركيب أو التجميع وإنشاء الطرق والجسور وخدمات الدهان وعمال تركيب شــــــــبكات التدفئة والأسطح وبناء السفن وخدمات تأجير أدوات ومواد البناء وخدمات الإصلاح والترميم والصيانة وغسـل السيارات وخدمات التنظيف وتأجير الأجهزة والأدوات الخاصة بالبناء وحفر الآبار وخدمات الكوي وخدمات الإنارة وتركيب وإصلاح المصاعد والمكيفات، محطات خدمة وإصلاح وصيانة وتشــحيم المركبات ، تنجيد وإصلاح الأثاث',
        },
        {
            category_id: '38',
            category_name: 'الفئة 37',
            materials:
                'خدمات الاتصالات والانترنيت والإذاعة بالراديو والبث بالتلفزيون والبريد الالكتروني وإرســــــال الفاكسات ووكالات الأنباء وتأجير كافة أجهزة الاتصال والخدمات البرقية والتلفونات والتلكس والخدمات السلكية ومعلومات وتوجيه وربط الاتصالات',
        },
        {
            category_id: '39',
            category_name: 'الفئة 38',
            materials:
                'خدمات الاتصالات والانترنيت والإذاعة بالراديو والبث بالتلفزيون والبريد الالكتروني وإرســــــال الفاكسات ووكالات الأنباء وتأجير كافة أجهزة الاتصال والخدمات البرقية والتلفونات والتلكس والخدمات السلكية ومعلومات وتوجيه وربط الاتصالات',
        },
        {
            category_id: '40',
            category_name: 'الفئة 39',
            materials:
                'خدمات الشـحن والنقل والتغليف وتخزين السلع وتنظيم الرحلات والسفر وخدمات استثمار المحطات والجســــــور والسكك الحديدية وتأجير السيارات وخدمات بحرية ( تفريغ البضائع ) وتشــــغيل الموانئ وأحواض السفن والمطارات وخدمات نقل الركاب والمجموعات السياحية والسياحة والسفر وتنظيم الرحلات وتأجير أجهزة النقل وتوزيع الماء وخدمة القطارات وتســليم الرســائل والطرود والبضائع والصحف ومواقف السيارات وخدمات قيادة السيارات وتأجير المستودعات وحاويات التخزين',
        },
        {
            category_id: '41',
            category_name: 'الفئة 40',
            materials:
                'معالجة المواد ، إزالة الروائح الكريهة وتلطيف الجو وتنقية الهواء ، تعديل وتفصيل وخياطة الملابــــس ، معالجة الأقمشة والنســـيج والورق ، ذبح الحيوانات ، خدمات الحدادة والنجارة والتنجيد والنقش والخياطة والدباغة والنحاسـة واللحام ، خدمات الطباعة والتجليد والصباغة ، طحن الدقيق وأعمال الطحن وحفظ الأطعمة والمشــروبات وعصر الفواكه ، خراطة المفاتيح والحفر بالليزر ، إنتاج الطاقة وخدمات التكرير وتأجير المولدات ونشر الخشب ، معالجة المياه والصوف ، أعمال الطلاء',
        },
        {
            category_id: '42',
            category_name: 'الفئة 41',
            materials:
                'خدمات التعليم والتهذيب والتدريب والترفيه والأنشطة الرياضية والثقافية وخدمة الملاهي والترفيه والســيرك وتنظيم مسابقات الجمال والمدارس والجامعات والمعاهد والمراهنات وإنتاج الأفلام وخدمات أوركسترا وخدمات موسيقية والتصوير الفوتوغرافي والتربية البدنية وتأجير الأجهزة الكهربائية الخاصة بالســينما وتأجير الملاعب وإنتاج البرامج التلفزيونية والراديو والأفلام وحدائق الحيوان والمســرحيات ، تنظيم وإدارة الحلقات الدراسية والمؤتمرات والاجتماعات والندوات وورشــــــات العمل وخدمات النوادي وتنظيم المباريات أو المنافسات والديسكو والنوادي الليلية ، نشـــر الكتب والنصوص وخدمات الترجمة',
        },
        {
            category_id: '43',
            category_name: 'الفئة 42',
            materials:
                'الخدمات العلمية والتقنية والبرمجية وخدمات البحث والتصميم المتعلقة بها وخدمات التحاليل والأبحاث الصناعية وخدمات تصميم وتحميل ونسخ وتأجير وصيانة وتحديث وتطوير العتاد الحاسوبي والبرمجيات الحاسوبية وتصميم صفحات الالكترونية على شبكة الانترنيت واسترجاع بيانات الحاسوب وخدمات واستشارات في مجال أجهزة الحاسوب والبرمجيات الحاسوبية ورسم تصاميم ومخططات الإنشاء ومراقبة الجودة وتأجير خادمات الشبكة وتوفير آلات بحث في الإنترنت وتصميم أنظمة حاسوب وخدمات الوقاية من الفيروسات الحاسوبية.',
        },
        {
            category_id: '44',
            category_name: 'الفئة 43',
            materials:
                'خدمات المطاعم والفنادق والكافيتيريا والمقاهي والوجبات الســـريعة ، مكاتب تأمين الإقامة وخدمات مخيمات العطلات ، تأجير وحجز أماكن الإقامة المؤقتة ، تأجير الخيم ، إيــواء الحيوانات وخدمات الحانات ، دور الحضانة النهاريـة ، تأجير الكراسي والموائد وبياضات الموائد والأواني الزجاجية ، تأجير غرف الاجتماعات',
        },
        {
            category_id: '45',
            category_name: 'الفئة 44',
            materials:
                'الخدمات الطبية ، الخدمـات البيطرية ، خدمات العناية الصحية والمحافظة على الجمال للكائنات البشرية أو الحيوانات ، خدمات الزراعة والبستنة والغابات ، خدمات المشافي والرعاية والعناية الصحية والعيادات الطبية وخدمـات العلاج الطبيعي والنصائح الصيدلانيـة والمصحات ، تربية وتنظيف الحيوانات والعناية بها ، خدمات العلاج بالعطور والتلقيــح الصناعي ، خدمات الحمامات العامة والتركية وصالونات التجميل وزراعة الشعر وصالونات تســـريح الشعر والمساج ودور نقاهة والراحة ، خدمات بنوك الدم ، تنسـيق الزهور وصناعة أكاليل الزهور وزراعة الحدائق والعناية بالعشب ، خدمات علماء النفس وفنيي البصريات',
        },
        {
            category_id: '46',
            category_name: 'الفئة 45',
            materials:
                'الخدمات الشخصية والاجتماعية المقدمة من الغير لتلبية احتياجات الأفراد ، وخدمات الأمـن لحمايـة الممتلكات والأشخاص.',
        },
    ],
);

export const [languages] = createResource(
    // () => getData('table', 'language'),
    () => [
        {
            language_id: '1',
            name: 'لغة واحدة (العربية)',
        },
        {
            language_id: '2',
            name: ' لغة واحدة (العربية)، مع رسم',
        },
        {
            language_id: '3',
            name: ' لغتين (العربية) و (الانكليزية)',
        },
        {
            language_id: '4',
            name: 'لغتين (العربية) و (الانكليزية) مع رسم',
        },
    ],
);

export const [applicationType] = createResource(
    // () => getData('table', 'application_typ'),
    () => [
        {
            type_id: '1',
            type_name: 'طلب تسجيبل',
        },
        {
            type_id: '2',
            type_name: 'طلب تجديد',
        },
    ],
);

export const [customers, { refetch: refetchCustomers, mutate: mutateCustomers }] = createResource(() =>
    getData('table', 'customer')
);

export const [agent, { refetch: refetchAgent, mutate: mutateAgent }] = createResource(() => getData('table', 'agent'));

export function updateResource(
    mutateFunction: Function,
    id: number,
    key: string,
    updatedData: any,
) {
    mutateFunction((prevItems: any[]) => {
        const index = prevItems.findIndex((item: any) => +item[key] === +id);
        if (index !== -1) {
            const updatedItems = [...prevItems];
            updatedItems[index] = { ...updatedItems[index], ...updatedData };
            return updatedItems;
        }
        return prevItems;
    });
}
